---
kind: property
id: P:Autodesk.Revit.DB.BaseImportOptions.Placement
source: html/944f0437-1dcf-9fe1-80a8-7eb13b963d1f.htm
---
# Autodesk.Revit.DB.BaseImportOptions.Placement Property

Where to place the import.
 Set this option to place the view at the origin or the center, or a shared coordinates.

## Syntax (C#)
```csharp
public ImportPlacement Placement { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration